Revit 2027 API
FamilyElementVisibility.IsShownInMedium Property
Indicates if the instance is display with Medium detail level in the view of project document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsShownInMedium { get; set; }
Public Property IsShownInMedium As Boolean
	Get
	Set
public:
property bool IsShownInMedium {
	bool get ();
	void set (bool value);
}
member IsShownInMedium : bool with get, set
Property Value
Boolean
Remarks
This property cannot be set to false if the other two detail levels are also false.
See Also
Reference
FamilyElementVisibility Class
Autodesk.Revit.DB Namespace